package ezbuy

import (
	"encoding/json"
	"log"
)


type Result struct{
	IsSucc bool `json:"isSucc"`
	ErrorMsg string `json:"error_msg"`
	Data interface{} `json:"data"`
}

type Data interface {}

var RunSta=RunStatus{}

func Encode(v interface {})string{
	body,err:=json.Marshal(v)
	if err!=nil{
		log.Println(err)
		return ""
	}
	return string(body)
}

type RunStatus struct {
	//检查新订单状态
	CheckNewordersRunSta string `json:"checknewordersrunsta"`
	RefreshRunSta string `json:"refreshrunsta"`
}

//137102
/*
var {
	76252	52
	76225	54
	115292	56
}
*/
type Style struct {
	Label string  `json:"label"`
	Value int  `json:"value"`
}

var Styles =map[int]string{
	65879:	"奢华",
	65932:	"卡通",
	137771:	"淑女",
	65978:	"甜美",
	115099:	"街头",
	65885:	"简约",
	137770:	"森女",
	65961:	"欧美",
	66244:	"民族",
	65963:	"学院",
	65915:	"复古",
	55180:	"休闲",
	137769:	"韩系",
	137768:	"文艺",
	137767:	"OL",
	66240:	"性感",
}

var Colors=map[int]string{
	45955:"玛瑙色",
	46595:"大红",
	46597:"咖啡",
	63326:"蓝",
	63329:"绿",
	63331:"灰",
	46604:"橙",
	46601:"紫",
	46609:"红",
	118973:"全色",
	45813:"米色",
	45787:"黑色",
	45795:"蓝色",
	46611:"天蓝色",
	45809:"褐色",


	122610:"混色",
	46041:"彩色",
	46975:"棕色",
	122614:"橙/黑",
	122616:"黄黑",
	122618:"红黑",
	122620:"绿黑",
	122622:"蓝黑",
	122624:"粉黑",

	46588:"银",
	122689:"花色",
	122693:"桔红色",
	46613:"棕",
	75152:"褐色/棕色",
	122697:"天然",
	122699:"深卡布其色",
	81153:"深棕",
	81149:"浅棕",
	81151:"中棕",
	122704:"黄金色",
	122706:"棕红色",
	122708:"金发/亚麻色",
	122710:"自然黑",
	122846:"乌黑",
	67361:"染色",
	122849:"未染色",
	122851:"青古铜",
	122853:"紅古铜",
	122855:"古銀",
	122857:"古鋅",
	122859:"黑鎳",
	46188:"黄铜",
	48930:"红铜",
	67606:"哑光",
	122864:"铁灰色",
	122866:"激光亮",
	90535:"多彩",
	122869:"鎳色",
	122871:"無鎳白",
	47668:"透明的",
	122874:"金色的",
	122876:"天蓝",
	50018:"象牙",
	
	122910:"其它颜色",
	72414:"蓝色激光",
	72416:"绿色激光",
	72418:"红色激光",
	122925:"青",
	46606:"黄",
	122928:"洋红",
	122930:"黑彩一体",
	63324:"黑",
	122933:"淡青",
	122935:"淡红",
	45394:"其他",
	54742:"条纹",
	122939:"乳酪色",
	122941:"铁锈色",
	122943:"蓝色/绿色",
	122945:"红色/粉红色",
	122947:"银色/灰色",
	122949:"黄色/金色",
	100555:"橙子",
	116477:"红色 / 粉红色",
	116479:"银色 / 灰色",
	116483:"蓝色 / 绿色",
	116481:"黄色 / 金色",
	122962:"多色/印花",
	122964:"铜色",
	122966:"木色",
	122968:"湖蓝",
	122970:"宝蓝",
	122972:"透明色",
	122974:"深红",
	122976:"深蓝",
	122978:"透光的",
	122980:"磨砂的",
	122982:"涂釉的",
	116135:"拼色",
	122985:"黑色和杏色",
	122987:"黑灰",
	122989:"藏青",
	122991:"柚木色",
	122993:"月光银",
	122995:"胡桃木色",
	122997:"桃花心木色",
	63336:"白",
	123008:"枚红色",
	123010:"军绿",
	46590:"金",
	123013:"奶油白",
	123266:"中性色",
	123325:"哑光/镜面",
	85485:"豹纹",
	124571:"古铜黄色",
	46592:"粉红",
	46599:"茶",
	135001:"宝蓝色",
	54658:"荧光",
	136348:"黑字",
	136350:"烫金字",
	138010:"土黄色",
137997:"藕粉色",
137996:"浅杏色",
137995:"铁锈红",
137994:"香芋紫",
137993:"灰花色",
137992	:"粉桔色",
137991	:"驼色",
137990 : "皮粉",
137989	:"棕灰色",
137988	:"焦糖色",
137764	:"其他",
137987	:"深粉色",
137986	:"绛红色",
137985	:"米灰色",
137984	:"水绿",
137983	:"桔红色",
137982	:"黑灰色",
137981	:"蓝白色",
137980:"黑白色",
137979:	"黑花色",
137978:	"蓝花色",
137977:	"花色",
137976:	"茶金色",
137975:	"墨绿色",
137974:	"军绿色",
137973:	"橘色",
137972	:"军绿",
137971	:"咖花色",
137970	:"墨绿",
137969	:"绿花色",
137968:	"藏青色",
137967:	"如图",
137966:	"杏色",
137965:	"米杏",
137964:	"咖啡",
137963:	"图片色",
137962	:"紫红色",
137961	:"浅紫色",
137960:	"棕色",
137959:	"西瓜红",
137958	:"粉红色",
45805	:"金色",
45793	:"灰色",
109581 :"深灰色",
45789	:"绿色",
78590	:"卡其色",
45807	:"橙色",
45801	:"紫色",
45791	:"红色",
45803	:"银色",
45785	:"白色",
45797	:"黄色",
45815	:"多色",
45811	:"透明",
72423	:"深蓝色",
109585	:"浅灰色",
109570	:"酒红色",
46617	:"浅绿色",
46615	:"浅黄色",
109579:"深紫色",
46992	:"玫红色",
46980	:"桔黄色",
46990	:"乳白色",
122671	:"深黄色",
122683	:"浅蓝色",
122691	:"青色",
122842	:"渐变色",
122885	:"深红色",
122887	:"浅棕色",
122891	:"深棕色",
122897:	"米白色",
123006	:"荧光黄",
}

var Sizes=map[int]string{
	55591:"S",
	55589:"XS",
	53950:"XXS",
	53952:"M",
	55594:"L",
	53954:"XL",
	55597:"XXL",
	55613:"均码",
	55607:"单一码",
	55615:"XXXL",
	55619:"XXXS",
	57194:"更大码",
}

var Sizes58308=map[int]string{
	55594:  "L",
	53952:	"M",
	55591:	"S",
	53954:	"XL",
	55597:	"XXL",
	55601:	"4XL",
	55603:	"5XL",
	55605:	"6XL",
	55589:	"XS",
	53950:	"XXS",
	55615:	"XXXL",
}




var Materials=map[int]string{
	137754:	"纱",
	50229:	"合成材料",
	115405:	"鸭绒",
	137729:	"真丝",
	137728:	"灯芯绒",
	48115:	"竹纤维",
	45388:	"皮革",
	48117:	"莫代尔",
	48134:	"莱卡",
	46929:	"尼龙",
	45426:	"涤纶",
	48078:	"腈纶",
	48082:	"亚麻",
	45364:	"牛仔布",
	48144:	"雪纺",
	137540:	"毛呢",
	48109:	"羊绒",
	48092:	"羊毛",
	48075:	"棉",
}



func GetColors()(colors []Color){
	colors=[]Color{}
	for id,name:=range Colors{
		colors=append(colors,Color{id,name,""})
	}
	return colors
}

func GetSizes()(sizes []Size){
	sizes=[]Size{}
	for id,name:=range Sizes{
		sizes=append(sizes,Size{id,name})
	}
	return sizes
}

func GetColor(name string) Color{
	for id,color:=range Colors{
		if color==name{
			return Color{id,color,""}
		}
	}
	return Color{0,name,""}
}

func GetSize(name string) Size{
	for id,size:=range Sizes{
		if size==name{
			return Size{id,size}
		}
	}
	return Size{0,name}
}
